MAIN_MENU_TEXT = '/find - 🔍Найти сборку\n/add - ➕Добавить сборку\n/my - 🖥мои сборки'


class MyText:
    NOT_PRESENT = 'сборок нету((('
    YOUR_BUILDS = 'вот твои сборки'
    EDIT_PC = 'изменить сборку'


class FindText:
    ADD_FILTERS = 'добавь фильтры'
    ENTER_MIN_PRICE = 'введи минимальную цену'
    ENTER_MAX_PRICE = 'введи максимальную цену'
    ENTER_USERNAME = 'введи username автора'
    ENTER_TITLE = 'введи название сборки'
    SELECT_TIME_PERIOD = 'выбери промежуток времени'
    SEARCHING = 'поиск...'
    NOTHING_FOUND = 'ничего не найдено😔'
    NO_MORE_BUILDS = 'больше сборок нет'


class AddText:
    ADD_COMPONENTS = 'добавить комплектующие'
    ENTER_TITLE = 'введи название сборки'
    ENTER_MODEL = 'введи название модели'
    ENTER_PRICE = 'введи цену'
    ENTER_AMOUNT = 'введи количество (1 по умолчанию)'
    ENTER_LINK = 'введи ссылку'
    CHANGE_BUILD = 'изменить сборку'
    EDIT = 'изменить'
    ENTER_COMPONENT = 'какое комплектующее хочешь добавить?'
    EDIT_BUILD = 'изменить сборку'
    PC_SAVED = 'сборка сохранена'
